define(function (require) {
    var ret = {};

    //
    ret.getGridData = function () {
        return [
            { ID: 1, aa: '待质检', bb: '正常', cc: '正常', dd: '14-0566-001-1010-001', ee: '定矩环:Q235-A', ff: 'JX-XMK-042-14HVH-01-03-04', gg: '', hh: '1000', ii: '1000', jj: '7000', kk: '6000', ll: '' },
            { ID: 2, aa: '待质检', bb: '正常', cc: '正常', dd: '14-0566-001-1010-001', ee: '定矩环:Q235-A', ff: 'JX-XMK-042-14HVH-01-03-04', gg: '', hh: '1000', ii: '1000', jj: '7000', kk: '6000', ll: '' },
            { ID: 3, aa: '待质检', bb: '正常', cc: '正常', dd: '14-0566-001-1010-001', ee: '定矩环:Q235-A', ff: 'JX-XMK-042-14HVH-01-03-04', gg: '', hh: '1000', ii: '1000', jj: '7000', kk: '6000', ll: '' },
            { ID: 4, aa: '待质检', bb: '正常', cc: '正常', dd: '14-0566-001-1010-001', ee: '定矩环:Q235-A', ff: 'JX-XMK-042-14HVH-01-03-04', gg: '', hh: '1000', ii: '1000', jj: '7000', kk: '6000', ll: '' },
            { ID: 5, aa: '待质检', bb: '正常', cc: '正常', dd: '14-0566-001-1010-001', ee: '定矩环:Q235-A', ff: 'JX-XMK-042-14HVH-01-03-04', gg: '', hh: '1000', ii: '1000', jj: '7000', kk: '6000', ll: '' },
            { ID: 6, aa: '待质检', bb: '正常', cc: '正常', dd: '14-0566-001-1010-001', ee: '定矩环:Q235-A', ff: 'JX-XMK-042-14HVH-01-03-04', gg: '', hh: '1000', ii: '1000', jj: '7000', kk: '6000', ll: '' },
            { ID: '', aa: '', bb: '', cc: '', dd: '', ee: '', ff: '', gg: '', hh: '', ii: '', jj: '', kk: '', ll: '' },
            { ID: '', aa: '', bb: '', cc: '', dd: '', ee: '', ff: '', gg: '', hh: '', ii: '', jj: '', kk: '', ll: '' },
            { ID: '', aa: '', bb: '', cc: '', dd: '', ee: '', ff: '', gg: '', hh: '', ii: '', jj: '', kk: '', ll: '' }
        ]
    }

    ret.reGetGridData = function () {
        return [
            { ID: 1, aa: '待质检', bb: '正常', cc: '正常', dd: '14-0566-001-1010-001', ee: '定矩环:Q235-A', ff: 'JX-XMK-042-14HVH-01-03-04', gg: '', hh: '1000', ii: '1000', jj: '7000', kk: '6000', ll: '' },
            { ID: 2, aa: '待质检', bb: '正常', cc: '正常', dd: '14-0566-001-1010-001', ee: '定矩环:Q235-A', ff: 'JX-XMK-042-14HVH-01-03-04', gg: '', hh: '1000', ii: '1000', jj: '7000', kk: '6000', ll: '' }
        ]
    }

    return ret;
})