define(function (require) {
    var ret = {};

    //
    ret.getGridData = function () {
        return [
            { ID: 1, aa: '未提交', bb: '未审核', cc: '未审核', dd: '采购', ee: '生产计划部', ff: '82', gg: '2014/10/09', hh: '2014/12/30', ii: '14-0669-001-1039-001', jj: '1021001001356', kk: '视孔盖:Q235-A', ll: 'qjyxd03-11-01-07' },
            { ID: 2, aa: '未提交', bb: '未审核', cc: '已审核', dd: '采购', ee: '生产计划部', ff: '82', gg: '2014/10/09', hh: '2014/12/30', ii: '14-0669-001-1039-001', jj: '1021001001356', kk: '视孔盖:Q235-A', ll: 'qjyxd03-11-01-07' },
            { ID: 3, aa: '未提交', bb: '未审核', cc: '未审核', dd: '采购', ee: '生产计划部', ff: '82', gg: '2014/10/09', hh: '2014/12/30', ii: '14-0669-001-1039-001', jj: '1021001001356', kk: '视孔盖:Q235-A', ll: 'qjyxd03-11-01-07' },
            { ID: 4, aa: '未提交', bb: '未审核', cc: '未审核', dd: '采购', ee: '生产计划部', ff: '82', gg: '2014/10/09', hh: '2014/12/30', ii: '14-0669-001-1039-001', jj: '1021001001356', kk: '视孔盖:Q235-A', ll: 'qjyxd03-11-01-07' },
            { ID: 5, aa: '未提交', bb: '已审核', cc: '未审核', dd: '采购', ee: '生产计划部', ff: '82', gg: '2014/10/09', hh: '2014/12/30', ii: '14-0669-001-1039-001', jj: '1021001001356', kk: '视孔盖:Q235-A', ll: 'qjyxd03-11-01-07' },
            { ID: 6, aa: '未提交', bb: '未审核', cc: '未审核', dd: '采购', ee: '生产计划部', ff: '82', gg: '2014/10/09', hh: '2014/12/30', ii: '14-0669-001-1039-001', jj: '1021001001356', kk: '视孔盖:Q235-A', ll: 'qjyxd03-11-01-07' },
            { ID: '', aa: '', bb: '', cc: '', dd: '', ee: '', ff: '', gg: '', hh: '', ii: '', jj: '', kk: '', ll: '' },
            { ID: '', aa: '', bb: '', cc: '', dd: '', ee: '', ff: '', gg: '', hh: '', ii: '', jj: '', kk: '', ll: '' }
        ]
    }

    ret.reGetGridData = function () {
        return [
            { ID: 1, aa: '未提交', bb: '未审核', cc: '未审核', dd: '采购', ee: '生产计划部', ff: '82', gg: '2014/10/09', hh: '2014/12/30', ii: '14-0669-001-1039-001', jj: '1021001001356', kk: '视孔盖:Q235-A', ll: 'qjyxd03-11-01-07' },
            { ID: 2, aa: '未提交', bb: '未审核', cc: '已审核', dd: '采购', ee: '生产计划部', ff: '82', gg: '2014/10/09', hh: '2014/12/30', ii: '14-0669-001-1039-001', jj: '1021001001356', kk: '视孔盖:Q235-A', ll: 'qjyxd03-11-01-07' }
        ]
    }

    return ret;
})