define(function (require) {
    var ret = {};

    //
    ret.getGridData = function () {
        return [
            { ID: 1, aa: '1', bb: '1704-440A/1', cc: '1704-440-14', dd: '2017/8/14', ee: '消防机器人', ff: '天津消防', gg: '进行中', hh: '2014/05/30 14:07', ii: '生产计划部', jj: '星儿', kk: '质量检验部', ll: '' },
            { ID: 2, aa: '2', bb: '1704-440A/2', cc: '1704-440-11', dd: '2017/8/14', ee: '变频柜', ff: '南京商飞科技', gg: '进行中', hh: '2014/05/30 14:07', ii: '生产计划部', jj: '星儿', kk: '质量检验部', ll: '' },
            { ID: 3, aa: '3', bb: '1704-440A/3', cc: '1704-440-12', dd: '2017/8/14', ee: '消防机器人', ff: '北京消防', gg: '进行中', hh: '2014/05/30 14:07', ii: '生产计划部', jj: '星儿', kk: '质量检验部', ll: '' },
            { ID: 4, aa: '4', bb: '1704-440A/4', cc: '1704-440-13', dd: '2017/8/14', ee: '消防机器人', ff: '河北消防', gg: '进行中', hh: '2014/05/30 14:07', ii: '生产计划部', jj: '星儿', kk: '质量检验部', ll: '' },
            { ID: '', aa: '', bb: '', cc: '', dd: '', ee: '', ff: '', gg: '', hh: '', ii: '', jj: '', kk: '', ll: '' },
            { ID: '', aa: '', bb: '', cc: '', dd: '', ee: '', ff: '', gg: '', hh: '', ii: '', jj: '', kk: '', ll: '' },
            { ID: '', aa: '', bb: '', cc: '', dd: '', ee: '', ff: '', gg: '', hh: '', ii: '', jj: '', kk: '', ll: '' }
        ]
    }

    ret.reGetGridData = function () {
        return [
            { ID: 1, aa: '合格', bb: '1', cc: '1', dd: '已审核', ee: '配前检查', ff: '2014/06/18', gg: '2014/05/31', hh: '2014/05/30 14:07', ii: '生产计划部', jj: '星儿', kk: '质量检验部', ll: '' },
            { ID: 2, aa: '合格', bb: '2', cc: '2', dd: '已审核', ee: '配前检查', ff: '2014/06/18', gg: '2014/05/31', hh: '2014/05/30 14:07', ii: '生产计划部', jj: '星儿', kk: '质量检验部', ll: '' }
        ]
    }

    return ret;
})