define(function (require) {
    var ret = {};

    //
    ret.getGridData = function () {
        return [
            { ID: 1, aa: '1', bb: '8:13', cc: '特种机器人', dd: '设备报警', ee: '1', ff: '1#电闸跳闸10分钟', gg: '张晨', hh: '已处理', ii: '生产计划部', jj: '星儿', kk: '质量检验部', ll: '' },
            { ID: 2, aa: '2', bb: '9:12', cc: '特种机器人', dd: '库存不足', ee: '2', ff: '170317工作令物料短缺', gg: '王玉波', hh: '未处理', ii: '生产计划部', jj: '星儿', kk: '质量检验部', ll: '' },
            { ID: 3, aa: '3', bb: '10:33', cc: '特种机器人', dd: '计划超期', ee: '3', ff: '070512工作令超期', gg: '沈正义', hh: '未处理', ii: '生产计划部', jj: '星儿', kk: '质量检验部', ll: '' },
            { ID: 4, aa: '4', bb: '11:07', cc: 'PCBA', dd: '计划超期', ee: '3', ff: '040517工作令超期', gg: '沈正义', hh: '未处理', ii: '生产计划部', jj: '星儿', kk: '质量检验部', ll: '' }
            //{ ID: '', aa: '', bb: '', cc: '', dd: '', ee: '', ff: '', gg: '', hh: '', ii: '', jj: '', kk: '', ll: '' },
            //{ ID: '', aa: '', bb: '', cc: '', dd: '', ee: '', ff: '', gg: '', hh: '', ii: '', jj: '', kk: '', ll: '' },
            //{ ID: '', aa: '', bb: '', cc: '', dd: '', ee: '', ff: '', gg: '', hh: '', ii: '', jj: '', kk: '', ll: '' }
        ]
    }

    ret.reGetGridData = function () {
        return [
            { ID: 1, aa: '合格', bb: '1', cc: '1', dd: '已审核', ee: '配前检查', ff: '2014/06/18', gg: '2014/05/31', hh: '2014/05/30 14:07', ii: '生产计划部', jj: '星儿', kk: '质量检验部', ll: '' },
            { ID: 2, aa: '合格', bb: '2', cc: '2', dd: '已审核', ee: '配前检查', ff: '2014/06/18', gg: '2014/05/31', hh: '2014/05/30 14:07', ii: '生产计划部', jj: '星儿', kk: '质量检验部', ll: '' }
        ]
    }

    return ret;
})