define(function (require) {
    var ret = {};

    //
    ret.getGridData = function () {
        return [
            { ID: 1, aa: '合格', bb: '1', cc: '1', dd: '已审核', ee: '配前检查', ff: '2014/06/18', gg: '2014/05/31', hh: '2014/05/30 14:07', ii: '生产计划部', jj: '星儿', kk: '质量检验部', ll: '' },
            { ID: 2, aa: '合格', bb: '2', cc: '2', dd: '已审核', ee: '配前检查', ff: '2014/06/18', gg: '2014/05/31', hh: '2014/05/30 14:07', ii: '生产计划部', jj: '星儿', kk: '质量检验部', ll: '' },
            { ID: 3, aa: '合格', bb: '3', cc: '3', dd: '已审核', ee: '配前检查', ff: '2014/06/18', gg: '2014/05/31', hh: '2014/05/30 14:07', ii: '生产计划部', jj: '星儿', kk: '质量检验部', ll: '' },
            { ID: 4, aa: '合格', bb: '4', cc: '4', dd: '已审核', ee: '配前检查', ff: '2014/06/18', gg: '2014/05/31', hh: '2014/05/30 14:07', ii: '生产计划部', jj: '星儿', kk: '质量检验部', ll: '' },
            { ID: 5, aa: '合格', bb: '5', cc: '5', dd: '已审核', ee: '配前检查', ff: '2014/06/18', gg: '2014/05/31', hh: '2014/05/30 14:07', ii: '生产计划部', jj: '星儿', kk: '质量检验部', ll: '' },
            { ID: 6, aa: '合格', bb: '6', cc: '6', dd: '已审核', ee: '配前检查', ff: '2014/06/18', gg: '2014/05/31', hh: '2014/05/30 14:07', ii: '生产计划部', jj: '星儿', kk: '质量检验部', ll: '' },
            { ID: '', aa: '', bb: '', cc: '', dd: '', ee: '', ff: '', gg: '', hh: '', ii: '', jj: '', kk: '', ll: '' },
            { ID: '', aa: '', bb: '', cc: '', dd: '', ee: '', ff: '', gg: '', hh: '', ii: '', jj: '', kk: '', ll: '' },
            { ID: '', aa: '', bb: '', cc: '', dd: '', ee: '', ff: '', gg: '', hh: '', ii: '', jj: '', kk: '', ll: '' }
        ]
    }

    ret.reGetGridData = function () {
        return [
            { ID: 1, aa: '合格', bb: '1', cc: '1', dd: '已审核', ee: '配前检查', ff: '2014/06/18', gg: '2014/05/31', hh: '2014/05/30 14:07', ii: '生产计划部', jj: '星儿', kk: '质量检验部', ll: '' },
            { ID: 2, aa: '合格', bb: '2', cc: '2', dd: '已审核', ee: '配前检查', ff: '2014/06/18', gg: '2014/05/31', hh: '2014/05/30 14:07', ii: '生产计划部', jj: '星儿', kk: '质量检验部', ll: '' }
        ]
    }

    return ret;
})